lisp/clbe/clbe-18.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Advanced Looping</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Advanced Looping</h1>
<p>
Previous: <a href="clbe-17.html">17. Reading &amp; Writing to Files</a>
</p>

<p>
Next: <a href="clbe-19.html">19. Scope &amp; Extent</a>
</p>

<p>
The DO macro is a very powerful and flexible iterator. It looks like
this:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">do</span> ((var1 init1 step1)
     ...
     (varn initn stepn))
    (end-test result-forms*)
  body-forms*)

</pre>
</div>

<p>
Below is an example of the DO loop, together with a detailed step
through. This example will return 81 and print 1, 0, 1, 4, 9, 16, 25,
36, 49 and 64 on newlines. During each iteration, loop-step is
increased by one while square is set to the square of loop-step.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">do</span> ((loop-step 0 (+ loop-step 1))
     (square 1 (* loop-step loop-step)))
    ((= 10 loop-step) square) <span style="color: #b22222;">; Stop at 10</span>
  (print square)) <span style="color: #b22222;">; Print square at each step</span>

</pre>
</div>

<div id="outline-container-org967a1f5" class="outline-2">
<h2 id="org967a1f5">Step Through</h2>
<div class="outline-text-2" id="text-org967a1f5">
<p>
The init forms are evaluated at the beginning of the loop and bound to
the variables. In the above example, loop-step is bound to 0 while
square is bound to 1.
</p>

<p>
The end-test form is evaluated at the beginning of each iteration. If
it evaluates to NIL, the iteration proceeds and the body of the loop
is executed. Hence, in the above example you see 1 printed on the
first iteration, as that is the starting value of the square variable.
</p>

<p>
After all the body forms have been evaluated, and before each
subsequent iteration of the loop, the step forms will be evaluated and
their values will be bound to the variables.
</p>

<p>
In a DO loop, the step forms can refer to other variables defined by
the loop, but the value they receive for these variables is the value
before the step forms are evaluated. Thus, in the first update, square
is set to 0 as that is the value of loop-step before the step forms
are evaluated.
</p>

<p>
This can be seen in the printed output of 0 provided by the second
iteration of the loop.
</p>

<p>
Note in a DO loop, the init forms cannot refer to other variables
defined in the loop as they have not yet been bound to a value (the DO
loop, similar to LET, binds values in parallel).
</p>

<p>
After 10 iterations, the loop-step variable will have a value of
</p>
<ol class="org-ol">
<li>Accordingly, the end-test form will return T. When this occurs,</li>
</ol>
<p>
the result-forms are evaluated and the value of the last result form
is returned as the value of the loop.
</p>

<p>
In our example above, the value of square will be 81 at this point,
being the square of the last value of loop-step (9). This is the value
returned by the loop.
</p>

<p>
Note that the body-forms are not evaluated when the end-test is true,
and the last printed output is 64 in our example.
</p>
</div>
</div>

<div id="outline-container-orgd9abb24" class="outline-2">
<h2 id="orgd9abb24">The DO* Macro</h2>
<div class="outline-text-2" id="text-orgd9abb24">
<p>
The DO* macro is similar to a LET* form and binds its variables in
sequence. Therefore a variable can access the latest value of a
previously defined variable in either the initial or step forms. Below
is an near-identical example of the above, but with a DO* loop. The
DO* loop will return 100 and print 0, 1, 4, 9, 16, 25, 36, 48, 64 and
81 on newlines.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">do*</span> ((loop-step 0 (+ loop-step 1))
      (square loop-step (* loop-step loop-step)))
    ((= 10 loop-step) square) (print square))

</pre>
</div>

<p>
As a final example, consider the below, where we switch the lexical
positions of loop-step and square within the loop. This example will
return 81 and print 0, 0, 1, 4, 9, 16, 25, 36, 49, 64 and 81. Observe
how square is now accessing the prior value of loop-step, as it is
evaluated before loop-step and does not have access to its current
value. This is a reminder that the DO* loop performs its bindings in
sequence.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">do*</span> ((square 0 (* loop-step loop-step))
      (loop-step 0 (+ loop-step 1)))
    ((= 10 loop-step) square) (print square))

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
